# **Part 2: SQL Insights**

In [4]:
from urllib.parse import quote_plus
from sqlalchemy import create_engine
password = "Anaszaki1998@"  # Your actual password with special characters
encoded_password = quote_plus(password)
engine = create_engine(f"mysql+pymysql://root:{encoded_password}@localhost/library")
print("Connected to MySQL successfully!")

#if you want to select manually database and you have created database already so with this you can work on that database

Connected to MySQL successfully!

In [10]:
import pandas as pd
df = pd.read_csv('../Data//Book_Details.csv')
df.head()

                                   Title  Price  Ratings Availability
0                   A Light in the Attic  51.77        3     In stock
1                     Tipping the Velvet  53.74        1     In stock
2                             Soumission  50.10        1     In stock
3                          Sharp Objects  47.82        4     In stock
4  Sapiens: A Brief History of Humankind  54.23        5     In stock

In [8]:
df.to_sql("Book_Details",con = engine, if_exists = "replace", index = False)
print("Data is imported succesfully")
#this helps you to import your dataframe inside the sql

Data is imported succesfully

C:\Users\rakes\AppData\Local\Temp\ipykernel_43660\3646342243.py:1: UserWarning: The provided table name 'Book_Details' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql("Book_Details",con = engine, if_exists = "replace", index = False)

In [1]:
import mysql.connector

In [2]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "Anaszaki1998@"
)
cursor = conn.cursor()

# with this you can connect your mysql workbench

In [3]:
conn.database = "library"

In [6]:
cursor.execute("SELECT * FROM Book_Details;")
rows = cursor.fetchall()
pd.DataFrame(rows)

                                                     0      1  2         3
0                                 A Light in the Attic  51.77  3  In stock
1                                   Tipping the Velvet  53.74  1  In stock
2                                           Soumission  50.10  1  In stock
3                                        Sharp Objects  47.82  4  In stock
4                Sapiens: A Brief History of Humankind  54.23  5  In stock
..                                                 ...    ... ..       ...
995  Alice in Wonderland (Alice's Adventures in Won...  55.53  1  In stock
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  57.06  4  In stock
997  A Spy's Devotion (The Regency Spies of London #1)  16.97  5  In stock
998                1st to Die (Women's Murder Club #1)  53.98  1  In stock
999                 1,000 Places to See Before You Die  26.08  5  In stock

[1000 rows x 4 columns]

In [7]:
cursor.execute("SELECT * FROM Book_Details;")
rows = cursor.fetchall()

# Get column names from cursor.description
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame
# Create DataFrame with column names
df(rows, columns=columns)

,Title,Price,Ratings,Availability
0,A Light in the Attic,51.77,3,In stock
1,Tipping the Velvet,53.74,1,In stock
2,Soumission,50.10,1,In stock
3,Sharp Objects,47.82,4,In stock
4,Sapiens: A Brief History of Humankind,54.23,5,In stock
...,...,...,...,...
995,Alice in Wonderland (Alice's Adventures in Won...,55.53,1,In stock
996,"Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)",57.06,4,In stock
997,A Spy's Devotion (The Regency Spies of London #1),16.97,5,In stock
998,1st to Die (Women's Murder Club #1),53.98,1,In stock
999,"1,000 Places to See Before You Die",26.08,5,In stock

##### **1. Find the number of books available in stock.** #####

In [42]:
cursor.execute("SELECT COUNT(Title) as Number_Of_Books FROM Book_Details WHERE Availability = 'In Stock';")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)
# I have already mentioned df = pd.DataFrame

   Number_Of_Books
0             1000

##### **2. List the top 5 most expensive books.**

In [43]:
cursor.execute(
    "SELECT Title, Price "
    "FROM Book_Details "
    "ORDER BY Price DESC "
    "LIMIT 5;"
)

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

                                Title  Price
0  The Perfect Play (Play by Play #1)  59.99
1   Last One Home (New Beginnings #1)  59.98
2    Civilization and Its Discontents  59.95
3      The Barefoot Contessa Cookbook  59.92
4           The Diary of a Young Girl  59.90

##### **3. List the top 5 most cheapest books.**

In [55]:
cursor.execute(
    "SELECT Title, Price "
    "FROM Book_Details "
    "ORDER BY Price "
    "LIMIT 05; "
)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

                                               Title  Price
0                         An Abundance of Katherines  10.00
1                              The Origin of Species  10.01
2  The Tipping Point: How Little Things Can Make ...  10.02
3                                           Patience  10.16
4                               Greek Mythic History  10.23

##### **4. Find the average rating of books.**

In [45]:
cursor.execute(
    "SELECT AVG(Ratings) as Average_rating "
    "FROM Book_Details; "
)

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

  Average_rating
0         2.9230

##### **5. Retrieve the total number of books for each rating (e.g., 1-star, 2-star, etc.).**

In [51]:
cursor.execute(
    "SELECT Ratings, COUNT(Ratings) as Number_Of_Books "
    "FROM Book_Details "
    "GROUP BY Ratings "
    "ORDER BY Ratings; ")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns= columns)

   Ratings  Number_Of_Books
0        1              226
1        2              196
2        3              203
3        4              179
4        5              196

##### **6. What is the average price of books for each rating category?**

In [57]:
cursor.execute(
    "SELECT Ratings, ROUND(AVG(Price),2) as avg_price "
    "FROM Book_Details "
    "GROUP BY Ratings "
    "ORDER BY Ratings; "
)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

   Ratings  avg_price
0        1      34.56
1        2      34.81
2        3      34.69
3        4      36.09
4        5      35.37

##### **7. How many books fall into different price ranges (e.g., 0-25, 26-50, etc.)**

In [8]:
cursor.execute("""
SELECT 
    CASE  
        WHEN Price >= 0 AND Price <= 25 THEN '0-25'
        WHEN Price > 25 AND Price <= 50 THEN '26-50'
        WHEN Price > 50 AND Price <= 75 THEN '51-75'
        ELSE '75+'
    END AS Price_Range,
    COUNT(*) AS book_count  
FROM Book_Details  
GROUP BY Price_Range  
ORDER BY Price_Range;
""")

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

  Price_Range  book_count
0        0-25         299
1       26-50         503
2       51-75         198

##### **8. Which books have a price more than the average price?**

In [9]:
cursor.execute("""
SELECT Title, Price
FROM Book_Details
WHERE Price > (SELECT AVG(Price) FROM Book_Details)
ORDER BY Price DESC;
""")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

                                                 Title  Price
0                   The Perfect Play (Play by Play #1)  59.99
1                    Last One Home (New Beginnings #1)  59.98
2                     Civilization and Its Discontents  59.95
3                       The Barefoot Contessa Cookbook  59.92
4                            The Diary of a Young Girl  59.90
..                                                 ...    ...
508                  Doing It Over (Most Likely To #1)  35.61
509  So Cute It Hurts!!, Vol. 6 (So Cute It Hurts!!...  35.43
510                                    The Darkest Lie  35.35
511                                        Most Wanted  35.28
512                        Breaking Dawn (Twilight #4)  35.28

[513 rows x 2 columns]

In [10]:
# Break or Connection between SQL and Python
cursor.close()

True

In [11]:
conn.close()